telespial/EdgeAI_sphere_demo_NXP_FRDM-MCXN947/src/edgeai_sand_demo.c
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "accel4_click.h"
#include "fxls8974cf.h"
#include "par_lcd_s035.h"
#include "sim.h"

#include "app.h"
#include "board.h"
#include "clock_config.h"
#include "fsl_clock.h"
#include "fsl_debug_console.h"
#include "fsl_lpi2c.h"
#include "pin_mux.h"

#define SIM_W 240u
#define SIM_H 160u

#define BALL_ACCEL_SCALE 12   /* responsiveness; higher = faster roll */
#define BALL_DAMP_NUM    250  /* 0..255, higher = less damping */

#ifndef EDGEAI_I2C
#define EDGEAI_I2C LPI2C3
#endif

/* Accel axis mapping.
 * If tilt directions feel wrong, adjust these and reflash.
 *
 * Current default fixes common "left/right inverted" mounting.
 */
#ifndef EDGEAI_ACCEL_SWAP_XY
#define EDGEAI_ACCEL_SWAP_XY 1
#endif
#ifndef EDGEAI_ACCEL_INVERT_X
#define EDGEAI_ACCEL_INVERT_X 1
#endif
#ifndef EDGEAI_ACCEL_INVERT_Y
#define EDGEAI_ACCEL_INVERT_Y 1
#endif

static uint32_t edgeai_i2c_get_freq(void)
{
    // FC3 I2C is wired to mikroBUS on FRDM-MCXN947 (see docs/HARDWARE.md).
    return CLOCK_GetLPFlexCommClkFreq(3u);
}

static bool edgeai_i2c_write(uint8_t addr7, uint8_t reg, const uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Write;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = (uint8_t *)data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static bool edgeai_i2c_read(uint8_t addr7, uint8_t reg, uint8_t *data, uint32_t len)
{
    lpi2c_master_transfer_t xfer;
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = addr7;
    xfer.direction = kLPI2C_Read;
    xfer.subaddress = reg;
    xfer.subaddressSize = 1;
    xfer.data = data;
    xfer.dataSize = len;
    xfer.flags = kLPI2C_TransferDefaultFlag;
    return (LPI2C_MasterTransferBlocking(EDGEAI_I2C, &xfer) == kStatus_Success);
}

static grav_dir_t grav_from_sample(const fxls8974_sample_t *s)
{
    // Very simple 8-way mapping from (x,y). Adjust signs based on your physical mounting.
    int32_t ax = s->x;
    int32_t ay = s->y;

#if EDGEAI_ACCEL_SWAP_XY
    int32_t tmp = ax; ax = ay; ay = tmp;
#endif
#if EDGEAI_ACCEL_INVERT_X
    ax = -ax;
#endif
#if EDGEAI_ACCEL_INVERT_Y
    ay = -ay;
#endif

    const int32_t dead = 256; // rough deadzone in raw 12-bit units
    if ((ax > -dead) && (ax < dead) && (ay > -dead) && (ay < dead))
    {
        return GRAV_S;
    }

    bool right = ax > dead;
    bool left = ax < -dead;
    bool down = ay > dead;
    bool up = ay < -dead;

    if (up && right) return GRAV_NE;
    if (up && left) return GRAV_NW;
    if (down && right) return GRAV_SE;
    if (down && left) return GRAV_SW;
    if (up) return GRAV_N;
    if (down) return GRAV_S;
    if (left) return GRAV_W;
    return GRAV_E;
}

static void map_accel_xy(int32_t *ax, int32_t *ay)
{
    if (!ax || !ay) return;
#if EDGEAI_ACCEL_SWAP_XY
    int32_t tmp = *ax; *ax = *ay; *ay = tmp;
#endif
#if EDGEAI_ACCEL_INVERT_X
    *ax = -*ax;
#endif
#if EDGEAI_ACCEL_INVERT_Y
    *ay = -*ay;
#endif
}

static void seed_world(sim_grid_t *g)
{
    sim_clear(g);

    /* "Screen covered in sand": mostly sand with a small amount of air so it can move. */
    for (uint16_t y = 0; y < g->h; y++)
    {
        for (uint16_t x = 0; x < g->w; x++)
        {
            material_t m = MAT_SAND;
            if (y < 6) m = MAT_EMPTY; /* thin air pocket at top */

            /* sprinkle a few holes so things can flow */
            uint32_t h = (uint32_t)(x * 1103515245u + y * 12345u);
            if ((h & 0xFFu) < 6u) m = MAT_EMPTY;

            sim_set(g, x, y, m);
        }
    }

    /* Metal frame. */
    for (uint16_t x = 0; x < g->w; x++)
    {
        sim_set(g, x, 0, MAT_METAL);
        sim_set(g, x, g->h - 1, MAT_METAL);
    }
    for (uint16_t y = 0; y < g->h; y++)
    {
        sim_set(g, 0, y, MAT_METAL);
        sim_set(g, g->w - 1, y, MAT_METAL);
    }
}

int main(void)
{
    BOARD_InitHardware();

    // Init I2C3 (FC3 pins).
    lpi2c_master_config_t masterCfg;
    LPI2C_MasterGetDefaultConfig(&masterCfg);
    masterCfg.baudRate_Hz = 400000u;
    LPI2C_MasterInit(EDGEAI_I2C, &masterCfg, edgeai_i2c_get_freq());

    fxls8974_dev_t dev = {
        .addr7 = 0,
        .write = edgeai_i2c_write,
        .read = edgeai_i2c_read,
    };

    const uint8_t addrs[] = {ACCEL4_CLICK_I2C_ADDR0, ACCEL4_CLICK_I2C_ADDR1};
    uint8_t who = 0;
    bool found = false;
    for (size_t i = 0; i < (sizeof(addrs) / sizeof(addrs[0])); i++)
    {
        dev.addr7 = addrs[i];
        if (fxls8974_read_whoami(&dev, &who) && (who == FXLS8974_WHO_AM_I_VALUE))
        {
            found = true;
            break;
        }
    }

    if (!found)
    {
        PRINTF("FXLS8974CF not found on I2C (tried 0x18/0x19). WHO_AM_I=0x%02x\r\n", who);
        for (;;)
        {
        }
    }

    PRINTF("FXLS8974CF found at 0x%02x (WHO_AM_I=0x%02x)\r\n", dev.addr7, who);

    // Minimal configuration: set FSR and enable ACTIVE.
    (void)fxls8974_set_active(&dev, false);
    (void)fxls8974_set_fsr(&dev, FXLS8974_FSR_4G);
    (void)fxls8974_set_active(&dev, true);

    if (!par_lcd_s035_init())
    {
        PRINTF("LCD init failed\r\n");
        for (;;)
        {
        }
    }
    par_lcd_s035_fill(0x0000u);

    static uint8_t cells[SIM_W * SIM_H];
    sim_grid_t grid = {.w = SIM_W, .h = SIM_H, .cells = cells};
    sim_rng_t rng;
    sim_rng_seed(&rng, 0xC0DEF00Du);
    seed_world(&grid);

    fxls8974_sample_t s = {0};
    uint32_t tick = 0;

    /* Motion trail state at sim resolution. */
    static uint8_t prev_cells[SIM_W * SIM_H];
    static uint8_t trails[SIM_W * SIM_H];
    memcpy(prev_cells, grid.cells, sizeof(prev_cells));

    /* Ball state (single cell, fixed-point 24.8). */
    int32_t ball_x_fp = (int32_t)(SIM_W / 2u) << 8;
    int32_t ball_y_fp = (int32_t)(SIM_H / 2u) << 8;
    int32_t ball_vx_fp = 0;
    int32_t ball_vy_fp = 0;
    uint16_t ball_x = SIM_W / 2u;
    uint16_t ball_y = SIM_H / 2u;

    /* Shake detection */
    int32_t ax_lp = 0, ay_lp = 0, az_lp = 0;
    uint8_t shake_hold = 0;

    for (;;)
    {
        if (fxls8974_read_sample_12b(&dev, &s))
        {
            int32_t axm = (int32_t)s.x;
            int32_t aym = (int32_t)s.y;
            int32_t azm = (int32_t)s.z;
            map_accel_xy(&axm, &aym);

            /* Low-pass filter and shake metric (jerk-like). */
            ax_lp += (axm - ax_lp) >> 3;
            ay_lp += (aym - ay_lp) >> 3;
            az_lp += (azm - az_lp) >> 3;
            int32_t shake = (axm > ax_lp ? axm - ax_lp : ax_lp - axm) +
                            (aym > ay_lp ? aym - ay_lp : ay_lp - aym) +
                            (azm > az_lp ? azm - az_lp : az_lp - azm);
            if (shake > 900)
            {
                shake_hold = 20;
            }
            if (shake_hold)
            {
                shake_hold--;
                memset(trails, 0, sizeof(trails));
            }

            grav_dir_t g = grav_from_sample(&s);
            sim_step(&grid, g, &rng);
            sim_step(&grid, g, &rng);

            /* Ball "physics": inertia + swaps with sand/water; bounces off metal/bounds. */
            {
                /* Use filtered accel for smooth, responsive rolling. */
                int32_t axf = ax_lp;
                int32_t ayf = ay_lp;
                ball_vx_fp += (axf / 32) * BALL_ACCEL_SCALE;
                ball_vy_fp += (ayf / 32) * BALL_ACCEL_SCALE;

                /* Damping. */
                ball_vx_fp = (ball_vx_fp * BALL_DAMP_NUM) >> 8;
                ball_vy_fp = (ball_vy_fp * BALL_DAMP_NUM) >> 8;

                int32_t nx_fp = ball_x_fp + ball_vx_fp;
                int32_t ny_fp = ball_y_fp + ball_vy_fp;

                /* Bounds + bounce. */
                int32_t minx = 0, miny = 0;
                int32_t maxx = ((int32_t)grid.w - 1) << 8;
                int32_t maxy = ((int32_t)grid.h - 1) << 8;

                if (nx_fp < minx) { nx_fp = minx; ball_vx_fp = -(ball_vx_fp >> 1); }
                if (nx_fp > maxx) { nx_fp = maxx; ball_vx_fp = -(ball_vx_fp >> 1); }
                if (ny_fp < miny) { ny_fp = miny; ball_vy_fp = -(ball_vy_fp >> 1); }
                if (ny_fp > maxy) { ny_fp = maxy; ball_vy_fp = -(ball_vy_fp >> 1); }

                uint16_t nx = (uint16_t)(nx_fp >> 8);
                uint16_t ny = (uint16_t)(ny_fp >> 8);

                if (nx != ball_x || ny != ball_y)
                {
                    material_t dst = sim_get(&grid, nx, ny);
                    if (dst == MAT_METAL)
                    {
                        /* Bounce back. */
                        ball_vx_fp = -(ball_vx_fp >> 1);
                        ball_vy_fp = -(ball_vy_fp >> 1);
                    }
                    else
                    {
                        /* Ball is rendered as an overlay; do not modify the world cell types. */
                        ball_x = nx;
                        ball_y = ny;
                        ball_x_fp = nx_fp;
                        ball_y_fp = ny_fp;
                    }
                }
            }

            /* Render at a lower cadence than sim updates. */
            if ((tick % 4u) == 0u)
            {
                /* Update trails (ball-only; shake clears it). */
                for (uint32_t i = 0; i < (uint32_t)grid.w * (uint32_t)grid.h; i++)
                {
                    uint8_t t = trails[i];
                    trails[i] = (t > 8u) ? (uint8_t)(t - 8u) : 0u;
                    prev_cells[i] = grid.cells[i];
                }

                /* Stamp a glowing trail. */
                uint32_t bi = (uint32_t)ball_y * (uint32_t)grid.w + (uint32_t)ball_x;
                if (bi < (uint32_t)grid.w * (uint32_t)grid.h)
                {
                    trails[bi] = 255u;
                    if (ball_x > 0) trails[bi - 1] = 180u;
                    if (ball_x + 1 < grid.w) trails[bi + 1] = 180u;
                    if (ball_y > 0) trails[bi - grid.w] = 140u;
                    if (ball_y + 1 < grid.h) trails[bi + grid.w] = 140u;
                }

                par_lcd_s035_render_grid(&grid, trails, tick, ball_x_fp, ball_y_fp);
            }

            if ((tick++ % 60u) == 0u)
            {
                /* fsl_debug_console printf formatting can be picky; cast explicitly. */
                long ax = (long)((int32_t)s.x);
                long ay = (long)((int32_t)s.y);
                long az = (long)((int32_t)s.z);
                PRINTF("accel raw x=%ld y=%ld z=%ld grav=%u\r\n", ax, ay, az, (unsigned)g);
            }
        }
    }
}
